src/cf/Enums/ПричиныДобавленияВРегистрОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныДобавленияВРегистрОбъектыКЗагрузке</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетЗагрузкуДругихОбъектов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПолучениеЭтогоОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПоискСоответствия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаКонвертации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроверкиПриЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоНаКонвертацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовоКЗагрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаОтклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/РаботаСРезультатамиОбменаКлиентСервер/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область Отборы

// Снять пометки в отборе компоновки данных
// 
// Параметры:
//  НастройкиКомпоновки - НастройкиКомпоновкиДанных
//
Процедура СнятьПометкиВОтборе(НастройкиКомпоновки) Экспорт

	Если НастройкиКомпоновки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СнятьПометкиДляКоллекцииЭлементовОтбора(НастройкиКомпоновки.Отбор.Элементы)
	
КонецПроцедуры

// Формирует список выбора ранее использовавшихся вариантов отображаемых полей
// 
// Параметры:
//  История - СписокЗначений Из Структура -
// 
// Возвращаемое значение:
//  СписокЗначений Из Строка - представление и идентификатор ранее использовавшегося варианта
//
Функция РанееИспользовавшиесяОтображаемыеПоля(История) Экспорт
	
	ИспользовавшиесяВарианты = Новый СписокЗначений;
	
	Для Каждого ИсторическиеДанные Из История Цикл
		
		ПоляИсторическогоВарианта = Новый Массив;
		
		Для Каждого СтрокаИсторическиеДанные Из ИсторическиеДанные.Значение Цикл
			
			ПоляИсторическогоВарианта.Добавить(СтрокаИсторическиеДанные.ЗаголовокПоля);
			
		КонецЦикла;
		
		ПредставлениеИсторическогоВарианта = СтрСоединить(ПоляИсторическогоВарианта, "; "); 
		
		ИспользовавшиесяВарианты.Добавить(ИсторическиеДанные.ПолучитьИдентификатор(), ПредставлениеИсторическогоВарианта,, БиблиотекаКартинок.История);
		
	КонецЦикла;
	
	Возврат ИспользовавшиесяВарианты;
	
КонецФункции

// Формирует представление отображаемых реквизитов в отчета о данных объекта на  форме проблемы
// 
// Параметры:
//  Форма                       - ФормаКлиентскогоПриложения - форма, для которой формируется представление
//  ИменаЭлементовПредставления - Строка - имя элемента формы, для которого формируется представление
//
Процедура СформироватьПредставлениеОтображаемыеПоля(Форма, ИменаЭлементовПредставления = Неопределено) Экспорт
	
	ЭлементыФормы = Форма.Элементы;
	
	ВсегоРеквизитов   = 0;
	ВыбраноРеквизитов = 0;
	
	Для Каждого РодительскаяСтрока Из Форма.ОтображаемыеРеквизиты.ПолучитьЭлементы() Цикл
		
		Для Каждого ПодчиненнаяСтрока Из РодительскаяСтрока.ПолучитьЭлементы() Цикл
			
			ВсегоРеквизитов = ВсегоРеквизитов + 1;
			
			Если ПодчиненнаяСтрока.Выбран = 1 Тогда
				ВыбраноРеквизитов = ВыбраноРеквизитов + 1;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТекстЗаголовка = СтрШаблон(НСтр("ru = 'Отображаемые реквизиты (%1 из %2)'"), ВыбраноРеквизитов, ВсегоРеквизитов);
	
	Если ИменаЭлементовПредставления = Неопределено Тогда
		ЭлементыФормы.ОтображаемыеПоля.Заголовок = ТекстЗаголовка;
	Иначе
		Для Каждого ИмяЭлемента Из ИменаЭлементовПредставления Цикл
			
			ЭлементыФормы[ИмяЭлемента].Заголовок = ТекстЗаголовка;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Определить значение переключателя для родительской строки в дереве.
// 
// Параметры:
//  РодительскаяСтрока - ДанныеФормыЭлементДерева - строка, для которой надо определить значение переключателя
//  ИмяРеквизитаВыбран - Строка - имя колонки дерева, в которой находится реквизит "Выбран"
//
Процедура ОпределитьЗначениеПереключателяДляРодительскойСтроки(РодительскаяСтрока, ИмяРеквизитаВыбран) Экспорт
	
	ЕстьЛожь   = Ложь;
	ЕстьИстина = Ложь;
	
	Для Каждого ПодчиненнаяСтрока Из РодительскаяСтрока.ПолучитьЭлементы() Цикл
		
		Если ПодчиненнаяСтрока[ИмяРеквизитаВыбран] = 0 Тогда
			ЕстьЛожь   = Истина;
		ИначеЕсли ПодчиненнаяСтрока[ИмяРеквизитаВыбран] = 1 Тогда
			ЕстьИстина = Истина;
		КонецЕсли;
		
		Если ЕстьИстина 
			И ЕстьЛожь Тогда
			
			РодительскаяСтрока[ИмяРеквизитаВыбран] = 2;
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьЛожь Тогда
		РодительскаяСтрока[ИмяРеквизитаВыбран] = 0;
	ИначеЕсли ЕстьИстина Тогда
		РодительскаяСтрока[ИмяРеквизитаВыбран] = 1;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ИнформацияУстановкиСоответствия

// Формирует и размещает форматированную строку текста соответствия на форме проблемы
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, для которой формируется строка
//  ПараметрыФормирования - см. НовыйПараметрыФормированияТекстаСоответствияВФормеПроблемы
//
Процедура СформироватьТекстСоответствияВФормеПроблемы(Форма, ПараметрыФормирования) Экспорт
	
	ЦветГиперссылки = ПараметрыФормирования.ЦветГиперссылки;
	ТекстЗаголовка = "";
	
	Если ЗначениеЗаполнено(Форма.СоответствиеВИБ) Тогда
		
		ТекстЗаголовка = Новый ФорматированнаяСтрока(Строка(Форма.СоответствиеВИБ), , ЦветГиперссылки, , "ОткрытьОбъектИБ");
		
		Если ПараметрыФормирования.СоответствиеУстановленоВЭтойФорме Тогда
			
			ТекстОтменить = Новый ФорматированнаяСтрока(НСтр("ru = 'отменить'"), , ЦветГиперссылки, , "ОтменитьСоответствие");
			
			ТекстЗаголовка = Новый ФорматированнаяСтрока(ТекстЗаголовка, ", ", ТекстОтменить);
			
		КонецЕсли;
		
	Иначе
		
		ТекстЗаголовка = Новый ФорматированнаяСтрока(НСтр("ru = 'Не установлено'"));
		
		Если ПараметрыФормирования.ВыборСоответствияДоступен Тогда
			ТекстВыбратьОбъект = Новый ФорматированнаяСтрока(НСтр("ru = 'выбрать объект'"), , ЦветГиперссылки, , "УстановитьСоответствие");
			
			ТекстЗаголовка = Новый ФорматированнаяСтрока(ТекстЗаголовка, ", ", ТекстВыбратьОбъект);
		КонецЕсли;
		
	КонецЕсли;
	
	Форма.СоответствиеВИБСтрока = ТекстЗаголовка;
	
КонецПроцедуры

// Конструктор параметров формирования.
// 
// Возвращаемое значение:
//  Структура - содержит:
// * СоответствиеУстановленоВЭтойФорме - Булево             - признак того, что соответствие было установлено в этой форме
// * ЦветГиперссылки                   - Неопределено, Цвет - цвет, которым будет отображаться команда установки на форме
// * ВыборСоответствияДоступен          - Булево            - признак того, что выбор соответствия доступен
Функция НовыйПараметрыФормированияТекстаСоответствияВФормеПроблемы() Экспорт
	
	ПараметрыФормирования = Новый Структура;
	
	ПараметрыФормирования.Вставить("СоответствиеУстановленоВЭтойФорме", Ложь);
	ПараметрыФормирования.Вставить("ЦветГиперссылки",                   Неопределено);
	ПараметрыФормирования.Вставить("ВыборСоответствияДоступен",         Истина);
	
	Возврат ПараметрыФормирования;
	
КонецФункции

#КонецОбласти 

#Область ИнформацияБлокирует

// Формирует и размещает форматированную строку текста о блокировке других объектов на форме проблемы
// 
// Параметры:
//  Форма                       - ФормаКлиентскогоПриложения - форма, для которой формируется строка
//  Непосредственно            - Число                       - количество непосредственно блокируемых объектов
//  Опосредовано               - Число                       - количество опосредованно блокируемых объектов
//  ДанныеОпосредованоПолучены - Булево                      - признак того, что данные об опосредованном блокировании получены
//
Процедура СформироватьПредставлениеБлокирует(Форма, Непосредственно, Опосредовано, ДанныеОпосредованоПолучены) Экспорт
	
	ПредставлениеБлокирует = "";
	
	ВсегоБлокирует = Непосредственно + Опосредовано;
	
	Если ВсегоБлокирует > 0  Тогда
		
		Если ДанныеОпосредованоПолучены Тогда 
			
			ПредставлениеБлокирует = Новый ФорматированнаяСтрока(
				СтрШаблон(НСтр("ru = 'Блокирует всего - %1'"), ВсегоБлокирует),
				,
				Форма.ЦветГиперссылки,
				,
				"ОткрытьБлокируемыеОбъекты");
			
			Форма.Элементы.БлокируетОжидание.Видимость = Ложь;
			
		Иначе
			
			ПредставлениеБлокирует = Новый ФорматированнаяСтрока(
				СтрШаблон(НСтр("ru = 'Блокирует непосредственно - %1'"), Непосредственно),
				,
				Форма.ЦветГиперссылки,
				,
				"ОткрытьБлокируемыеОбъекты");
				
			Форма.Элементы.БлокируетОжидание.Видимость = Истина;
		
		КонецЕсли;
		
	Иначе
		
		Форма.Элементы.БлокируетОжидание.Видимость = Ложь;
		
	КонецЕсли;
	
	Форма.БлокируетПредставление = ПредставлениеБлокирует;

КонецПроцедуры

#КонецОбласти

#Область ВыводКомментария

// Формирует форматированную строку перехода в комментарий на форме проблемы
// 
// Параметры:
//  ДекорацияФормы - ДекорацияФормы - элемент, в который будет выведена сформированная строка
//  Комментарий    - Строка - комментарий к проблеме
//  ЦветГиперссылки - Цвет - цвет текста
//  КартинкаЕстьКомментарий - Картинка - картинка, которая будет отображаться в начале строки
//
Процедура СформироватьПереходВКомментарий(ДекорацияФормы, Комментарий, ЦветГиперссылки, КартинкаЕстьКомментарий) Экспорт
	
	Если ПустаяСтрока(Комментарий) Тогда
		
		ТекстПерехода = НСтр("ru = 'Написать комментарий'"); 
		
	Иначе
		
		ТекстПерехода = НСтр("ru = 'Есть комментарий'"); 
		
	КонецЕсли;
	
	ЗаголовокПерехода = Новый ФорматированнаяСтрока(ТекстПерехода,,ЦветГиперссылки, , "ПерейтиВКомментарий");
	
	Если Не ПустаяСтрока(Комментарий) Тогда
		ЗаголовокПерехода = Новый ФорматированнаяСтрока(КартинкаЕстьКомментарий, " ", ЗаголовокПерехода);
	КонецЕсли;
	
	ДекорацияФормы.Заголовок = ЗаголовокПерехода;
	
КонецПроцедуры

#КонецОбласти

#Область АнализаСодержимогоПолученныхДанных

// Определяет, есть ли гиперссылки в тексте
// 
// Параметры:
//  АнализируемыйТекст - Строка
// 
// Возвращаемое значение:
//  Булево - Истина если есть, Ложь если нет.
//
Функция ЕстьГиперссылкиВТексте(АнализируемыйТекст) Экспорт

	Для Каждого ПрефиксСсылки Из АнализируемыеПрефиксыСсылок() Цикл
		
		Если СтрНайти(АнализируемыйТекст, ПрефиксСсылки) Тогда
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции

// Возвращает префиксы анализируемых ссылок
// 
// Возвращаемое значение:
//  Массив Из Строка
//
Функция АнализируемыеПрефиксыСсылок() Экспорт

	АнализируемыеПрефиксы = Новый Массив;
	
	АнализируемыеПрефиксы.Добавить("http://");
	АнализируемыеПрефиксы.Добавить("https://");
	АнализируемыеПрефиксы.Добавить("www.");
	АнализируемыеПрефиксы.Добавить("ftp.");
	
	Возврат АнализируемыеПрефиксы;

КонецФункции

#КонецОбласти 

#Область ТипыМетаданных

// Определяет индекс картинки в коллекции по порядку идентификатора объекта метаданных
// 
// 
// Параметры:
//  ПорядокКоллекции - Число
// 
// Возвращаемое значение:
//  Число - Индекс картинки в коллекции
Функция ИндексКартинкиПоПорядку(ПорядокКоллекции) Экспорт
	
	Если ПорядокКоллекции = 4 Тогда 
		Возврат 4;
	ИначеЕсли ПорядокКоллекции = 5 Тогда 
		Возврат 8;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Типы причин добавления которые используются в списках рабочих мест по разбору результатов обмена.
// 
// Возвращаемое значение:
//  Массив Из ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке - 
//
Функция ТипыПричинДобавленияДляРаботыСРезультатамиОбмена() Экспорт
	
	ТипыПроблемДляВывода = Новый Массив;
	
	ТипыПроблемДляВывода.Добавить(ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПодтверждение"));
	ТипыПроблемДляВывода.Добавить(ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПоискСоответствия"));
	ТипыПроблемДляВывода.Добавить(ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи"));
	ТипыПроблемДляВывода.Добавить(ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи"));
	ТипыПроблемДляВывода.Добавить(ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетЗагрузкуДругихОбъектов"));
	ТипыПроблемДляВывода.Добавить(ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетсяПолучениеЭтогоОбъекта"));
	ТипыПроблемДляВывода.Добавить(ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаКонвертации"));
		
	Возврат ТипыПроблемДляВывода;
	
КонецФункции

// Типы причин добавления с которыми работает пользователь в рабочем месте по разбору результатов обмена.
// 
// Возвращаемое значение:
//  Массив Из ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке - 
//
Функция ТипыПричинДобавленияАнализируемыеПриОтработкеПользователем() Экспорт
	
	ТипыАнализируемыхПроблем = ТипыПричинДобавленияДляРаботыСРезультатамиОбмена();
	
	ТипыАнализируемыхПроблем.Добавить(ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроведения"));
	
	Возврат ТипыАнализируемыхПроблем;
	
КонецФункции

// Формирует текст с префиксом "для" по типу метаданных
// 
// Параметры:
//  ИмяТипаМетаданных - Строка
//  ВНижнемРегистре   - Булево - возвращать текст в нижнем регистре
// 
// Возвращаемое значение:
//  Строка - сформированный текст
Функция ТекстДляПоИмениОбъектаМетаданных(ИмяТипаМетаданных, ВНижнемРегистре = Ложь) Экспорт
	
	СтрокаДля        = ?(ВНижнемРегистре, НСтр("ru = 'для'"), НСтр("ru = 'Для'"));
	СтрокаИмяОбъекта = "";
	
	Если ИмяТипаМетаданных = "Константа"
		Или ИмяТипаМетаданных = "Константы" Тогда
		
		СтрокаИмяОбъекта = НСтр("ru = 'константы'");
	
	ИначеЕсли ИмяТипаМетаданных = "Справочник"
		Или ИмяТипаМетаданных = "Справочники" Тогда
		
		СтрокаИмяОбъекта = НСтр("ru = 'справочника'");
	
	ИначеЕсли ИмяТипаМетаданных = "Документ"
		Или ИмяТипаМетаданных = "Документы" Тогда
		
		СтрокаИмяОбъекта = НСтр("ru = 'документа'");
		
	ИначеЕсли ИмяТипаМетаданных = "РегистрСведений"
		Или ИмяТипаМетаданных = "РегистрыСведений" Тогда
		
		СтрокаИмяОбъекта = НСтр("ru = 'регистра сведений'");
		
	ИначеЕсли ИмяТипаМетаданных = "РегистрНакоплений"
		Или ИмяТипаМетаданных = "РегистрыНакопления"Тогда
		
		СтрокаИмяОбъекта = НСтр("ru = 'регистра накопления'");
		
	ИначеЕсли ИмяТипаМетаданных = "РегистрРасчета"
		Или ИмяТипаМетаданных = "РегистрыРасчета" Тогда
		
		СтрокаИмяОбъекта = НСтр("ru = 'регистра расчетов'");
		
	Иначе
		
		СтрокаИмяОбъекта = НСтр("ru = 'плана видов характеристик'");
		
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 %2", СтрокаДля, СтрокаИмяОбъекта);

КонецФункции

// Формирует имя типа объекта метаданных по полному имени объекта метаданных
// 
// Параметры:
//  ПолноеИмяТипаМетаданных - Строка
// 
// Возвращаемое значение:
//  Строка - Имя типа метаданных
Функция ИмяТипаМетаданныхПоПолномуИмени(ПолноеИмяТипаМетаданных) Экспорт

	Подстроки = СтрРазделить(ПолноеИмяТипаМетаданных, ".");
	
	Если Подстроки.Количество() <> 2 Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Возврат Подстроки[0];
	
КонецФункции

Функция ПредставлениеТипаМетаданных(ИмяТипаМетаданных) Экспорт
	
	Если ИмяТипаМетаданных = "Документ" Тогда
		
		Возврат НСтр("ru = 'документ'");
		
	ИначеЕсли ИмяТипаМетаданных = "Справочник" Тогда
		
		Возврат НСтр("ru = 'элемент справочника'");
		
	ИначеЕсли ИмяТипаМетаданных = "ПланВидовХарактеристик" Тогда 
		
		Возврат НСтр("ru = 'элемент плана видов характеристик'");
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область Прочее

// Конструктор параметров инициализации ключа записи РС "Объекты к загрузке"
// 
// Возвращаемое значение:
//  Структура - содержит:
// * ПолученныйОбъект   - Строка - 
// * ПравилоКонвертации - Строка - 
// * ОбъектФормата      - Строка - 
// * УзелПланаОбмена    - Неопределено, ПланОбменаСсылкаИмяПланаОбмена - план обмена корреспондент, из которого был
//                                                                       получен объект.
//
Функция НовыйКлючЗаписиОбъектыКЗагрузке() Экспорт
	
	ДанныеКлюча = Новый Структура;
	ДанныеКлюча.Вставить("ПолученныйОбъект",   "");
	ДанныеКлюча.Вставить("ПравилоКонвертации", "");
	ДанныеКлюча.Вставить("ОбъектФормата",      "");
	ДанныеКлюча.Вставить("УзелПланаОбмена",    Неопределено);
	
	Возврат ДанныеКлюча;
	
КонецФункции

// Ищет строку дерева в данных формы.
// 
// Параметры:
//  ГдеИскать          - ДанныеФормыКоллекцияЭлементовДерева - область поиска
//  Значение           - Произвольный                        - искомое значение
//  Колонка            - Строка                              - имя колонки
//  ИскатьВПодчиненных - Булево                              - признак того, что нужно искать в нижестоящих уровнях
// 
// Возвращаемое значение:
//  Неопределено - Найденная строка в данных формы дерево
Функция НайденнаяСтрокаВДанныхФормыДерево(ГдеИскать,Значение,Колонка,ИскатьВПодчиненных) Экспорт
	
	ЭлементыДерева = ГдеИскать.ПолучитьЭлементы();
	
	Для каждого ЭлементДерева Из ЭлементыДерева Цикл
		Если ЭлементДерева[Колонка] = Значение Тогда
			Возврат ЭлементДерева;
		ИначеЕсли  ИскатьВПодчиненных Тогда
			НайденнаяСтрока =  НайденнаяСтрокаВДанныхФормыДерево(ЭлементДерева,Значение,Колонка,ИскатьВПодчиненных);
			Если НайденнаяСтрока <> Неопределено Тогда
				Возврат НайденнаяСтрока;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Используется для параметров формы открытия проблемы, в случае если одна из проблем записи возвращается статус обновления.
// 
// Параметры:
//  ПричинаДобавления - ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке 
//  СтатусОбновленияОбъектаВИБ - ПеречислениеСсылка.СтатусыОбновленияОбъектаПриПроблемахЗаписи
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке,
//  ПеречислениеСсылка.СтатусыОбновленияОбъектаПриПроблемахЗаписи -
Функция ПричинаДобавленияИлиСтатусОбновленияВИБ(ПричинаДобавления, СтатусОбновленияОбъектаВИБ) Экспорт
	
	Если ПричинаДобавления = ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи")
		Или ПричинаДобавления = ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи")
		Или ПричинаДобавления = ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроведения") Тогда 
		
		Возврат СтатусОбновленияОбъектаВИБ;
		
	Иначе
		
		Возврат ПричинаДобавления;
		
	КонецЕсли;
	
КонецФункции

// Процедура управляет состоянием поля табличного документа.
//
// Параметры:
//  ПолеТабличногоДокумента - ПолеФормы - поле формы с видом ПолеТабличногоДокумента,
//                            для которого необходимо установить состояние.
//  Состояние               - Строка - задает вид состояния.
//  ТекстОшибки             - Строка - текст причины неактуальности отчета
//
Процедура УстановитьСостояниеПоляТабличногоДокумента(ПолеТабличногоДокумента, Состояние = "НеИспользовать", ТекстОшибки = "") Экспорт
	
	Если ТипЗнч(ПолеТабличногоДокумента) = Тип("ПолеФормы") 
		И ПолеТабличногоДокумента.Вид = ВидПоляФормы.ПолеТабличногоДокумента Тогда
		ОтображениеСостояния = ПолеТабличногоДокумента.ОтображениеСостояния;
		Если ВРег(Состояние) = "НЕИСПОЛЬЗОВАТЬ" Тогда
			ОтображениеСостояния.Видимость                      = Ложь;
			ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
			ОтображениеСостояния.Картинка                       = Новый Картинка;
			ОтображениеСостояния.Текст                          = "";
		ИначеЕсли ВРег(Состояние) = "НЕАКТУАЛЬНОСТЬ" Тогда
			ОтображениеСостояния.Видимость                      = Истина;
			ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
			ОтображениеСостояния.Картинка                       = Новый Картинка;
			ОтображениеСостояния.Текст                          = НСтр("ru = 'Отчет не актуален. Нажмите ""Обновить"" для обновления данных отчета.'");
		ИначеЕсли ВРег(Состояние) = "ОШИБКА" Тогда
			ОтображениеСостояния.Видимость                      = Истина;
			ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
			ОтображениеСостояния.Картинка                       = Новый Картинка;
			ОтображениеСостояния.Текст                          = ТекстОшибки;
		ИначеЕсли ВРег(Состояние) = "ФОРМИРОВАНИЕОТЧЕТА" Тогда  
			ОтображениеСостояния.Видимость                      = Истина;
			ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
			ОтображениеСостояния.Картинка                       = БиблиотекаКартинок.ДлительнаяОперация48;
			ОтображениеСостояния.Текст                          = НСтр("ru = 'Отчет формируется...'");
		Иначе
			ВызватьИсключение(НСтр("ru = 'Недопустимое значение параметра (параметр номер ''2'')'"));
		КонецЕсли;
	Иначе
		ВызватьИсключение(НСтр("ru = 'Недопустимое значение параметра (параметр номер ''1'')'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СнятьПометкиДляКоллекцииЭлементовОтбора(КоллекцияЭлементов)
	
	Для Каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		
		ЭлементОтбора.Использование = Ложь;
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
			СнятьПометкиДляКоллекцииЭлементовОтбора(ЭлементОтбора.Элементы);
			
		КонецЕсли;
		
	КонецЦикла
	
КонецПроцедуры

#КонецОбласти
